Afina_desktop/src/DataProcessors/Задачник/Задачник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Задачник</name>
</mdclass:DataProcessor>

Afina_desktop/src/InformationRegisters/СоответствиеИдентификаторовРешенийИПутейКФайлам/СоответствиеИдентификаторовРешенийИПутейКФайлам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеИдентификаторовРешенийИПутейКФайлам</name>
  <resources>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Afina_desktop/src/InformationRegisters/ОчередьЗадач/ОчередьЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВыполненияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Afina_desktop/src/Enums/СтатусыВыполненияЗадач/СтатусыВыполненияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВыполненияЗадач</name>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>ВыполняетсяТест</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
</mdclass:Enum>

Afina_desktop/src/DataProcessors/Задачник/Forms/Форма/Module.bsl
&НаКлиенте
Асинх Процедура РешениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл конфигурации(*.cf)|*.cf";
	ПутьКФайлу = Ждать Диалог.ВыбратьАсинх();
	
	Если Не ПутьКФайлу = Неопределено Тогда
	
		Решение = ПутьКФайлу[0];	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Загрузить(Команда)
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,Решение);
	Если Не ОписаниеФайла = Неопределено Тогда
		
		Идентификатор = Новый УникальныйИдентификатор;
		ОбработатьРешениеНаСервере(Задача, ОписаниеФайла.Адрес, Идентификатор);	
	    Решение = "";
		Элементы.РезультатыПроверки.Обновить();
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбработатьРешениеНаСервере(Задача, Адрес, Идентификатор)
	
	ПутьКФайлу = Константы.КаталогХраненияРешений.Получить() + Идентификатор + ".cf";
	
	
	
	НачатьТранзакцию();
	Попытка
		
		Файл = ПолучитьИзВременногоХранилища(Адрес);
		Файл.Записать(ПутьКФайлу);  
		
		ЗаписьРегистраСоответствий = РегистрыСведений.СоответствиеИдентификаторовРешенийИПутейКФайлам.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСоответствий.Идентификатор = Идентификатор;
		ЗаписьРегистраСоответствий.ПутьКФайлу = ПутьКФайлу;
		ЗаписьРегистраСоответствий.Записать();	
		
		ЗаписьОчереди = РегистрыСведений.ОчередьЗадач.СоздатьМенеджерЗаписи();
		ЗаписьОчереди.Задача = Задача;
		ЗаписьОчереди.Идентификатор = Идентификатор;
		ЗаписьОчереди.Период = ТекущаяДата();
		ЗаписьОчереди.Статус = Перечисления.СтатусыВыполненияЗадач.КОбработке; 
		//todo: заменить на текущегопользователя системы
		ЗаписьОчереди.Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Тестовый");
		ЗаписьОчереди.Записать();
        ЗафиксироватьТранзакцию();
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
	
	
	                         
КонецПроцедуры // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//todo: заменить на текущегопользователя системы
	РезультатыПроверки.Параметры.УстановитьЗначениеПараметра("Пользователь", Справочники.Пользователи.НайтиПоНаименованию("Тестовый"));
	РезультатыПроверки.Параметры.УстановитьЗначениеПараметра("Задача", Задача);


КонецПроцедуры


&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)
	РезультатыПроверки.Параметры.УстановитьЗначениеПараметра("Задача", Задача);
	Элементы.РезультатыПроверки.Обновить();
КонецПроцедуры
